data/increasing-clients/1-replicas/10-clients/2-trial/producer.txt
2018-11-27 03:26:03, 351293 records sent, 70258.6 records/sec (34.31 MB/sec), 689.7 ms avg latency, 892.0 max latency.
2018-11-27 03:26:08, 412021 records sent, 82404.2 records/sec (40.24 MB/sec), 780.6 ms avg latency, 852.0 max latency.
2018-11-27 03:26:13, 387717 records sent, 77543.4 records/sec (37.86 MB/sec), 812.0 ms avg latency, 858.0 max latency.
2018-11-27 03:26:18, 388213 records sent, 77642.6 records/sec (37.91 MB/sec), 814.6 ms avg latency, 849.0 max latency.
2018-11-27 03:26:23, 391902 records sent, 78380.4 records/sec (38.27 MB/sec), 806.1 ms avg latency, 924.0 max latency.
2018-11-27 03:26:28, 389422 records sent, 77884.4 records/sec (38.03 MB/sec), 823.6 ms avg latency, 883.0 max latency.
2018-11-27 03:26:33, 387903 records sent, 77580.6 records/sec (37.88 MB/sec), 815.8 ms avg latency, 847.0 max latency.
2018-11-27 03:26:38, 379595 records sent, 75919.0 records/sec (37.07 MB/sec), 841.8 ms avg latency, 942.0 max latency.
2018-11-27 03:26:43, 385020 records sent, 77004.0 records/sec (37.60 MB/sec), 816.6 ms avg latency, 865.0 max latency.
2018-11-27 03:26:48, 387965 records sent, 77593.0 records/sec (37.89 MB/sec), 822.7 ms avg latency, 859.0 max latency.
2018-11-27 03:26:53, 379471 records sent, 75894.2 records/sec (37.06 MB/sec), 837.1 ms avg latency, 932.0 max latency.
2018-11-27 03:26:58, 342829 records sent, 68565.8 records/sec (33.48 MB/sec), 880.8 ms avg latency, 1739.0 max latency.
2018-11-27 03:27:03, 379471 records sent, 75894.2 records/sec (37.06 MB/sec), 873.9 ms avg latency, 1790.0 max latency.
2018-11-27 03:27:08, 384400 records sent, 76880.0 records/sec (37.54 MB/sec), 823.7 ms avg latency, 870.0 max latency.
2018-11-27 03:27:13, 383687 records sent, 76737.4 records/sec (37.47 MB/sec), 829.6 ms avg latency, 861.0 max latency.
2018-11-27 03:27:18, 386322 records sent, 77249.0 records/sec (37.72 MB/sec), 821.2 ms avg latency, 847.0 max latency.
2018-11-27 03:27:23, 384803 records sent, 76960.6 records/sec (37.58 MB/sec), 825.0 ms avg latency, 854.0 max latency.
2018-11-27 03:27:28, 392801 records sent, 78560.2 records/sec (38.36 MB/sec), 808.9 ms avg latency, 837.0 max latency.
2018-11-27 03:27:33, 383284 records sent, 76656.8 records/sec (37.43 MB/sec), 828.5 ms avg latency, 859.0 max latency.
2018-11-27 03:27:38, 384741 records sent, 76948.2 records/sec (37.57 MB/sec), 822.1 ms avg latency, 859.0 max latency.
2018-11-27 03:27:43, 388895 records sent, 77779.0 records/sec (37.98 MB/sec), 821.3 ms avg latency, 862.0 max latency.
2018-11-27 03:27:48, 386167 records sent, 77233.4 records/sec (37.71 MB/sec), 820.3 ms avg latency, 851.0 max latency.
2018-11-27 03:27:53, 389732 records sent, 77946.4 records/sec (38.06 MB/sec), 813.6 ms avg latency, 854.0 max latency.
2018-11-27 03:27:58, 386198 records sent, 77239.6 records/sec (37.71 MB/sec), 823.2 ms avg latency, 845.0 max latency.
2018-11-27 03:28:03, 391933 records sent, 78386.6 records/sec (38.27 MB/sec), 810.3 ms avg latency, 846.0 max latency.
2018-11-27 03:28:08, 383501 records sent, 76700.2 records/sec (37.45 MB/sec), 826.8 ms avg latency, 856.0 max latency.
2018-11-27 03:28:13, 381610 records sent, 76322.0 records/sec (37.27 MB/sec), 829.4 ms avg latency, 857.0 max latency.
2018-11-27 03:28:18, 385516 records sent, 77103.2 records/sec (37.65 MB/sec), 824.0 ms avg latency, 859.0 max latency.
2018-11-27 03:28:23, 387035 records sent, 77407.0 records/sec (37.80 MB/sec), 820.9 ms avg latency, 847.0 max latency.
2018-11-27 03:28:28, 391096 records sent, 78219.2 records/sec (38.19 MB/sec), 810.7 ms avg latency, 848.0 max latency.
2018-11-27 03:28:33, 392181 records sent, 78436.2 records/sec (38.30 MB/sec), 811.2 ms avg latency, 862.0 max latency.
2018-11-27 03:28:38, 383439 records sent, 76687.8 records/sec (37.45 MB/sec), 827.1 ms avg latency, 876.0 max latency.
2018-11-27 03:28:43, 405914 records sent, 81182.8 records/sec (39.64 MB/sec), 783.9 ms avg latency, 837.0 max latency.
2018-11-27 03:28:48, 387934 records sent, 77586.8 records/sec (37.88 MB/sec), 816.1 ms avg latency, 852.0 max latency.
2018-11-27 03:28:53, 385175 records sent, 77035.0 records/sec (37.61 MB/sec), 823.9 ms avg latency, 844.0 max latency.
2018-11-27 03:28:58, 390910 records sent, 78182.0 records/sec (38.17 MB/sec), 814.7 ms avg latency, 861.0 max latency.
2018-11-27 03:29:03, 385888 records sent, 77177.6 records/sec (37.68 MB/sec), 820.5 ms avg latency, 851.0 max latency.
2018-11-27 03:29:08, 385857 records sent, 77171.4 records/sec (37.68 MB/sec), 821.4 ms avg latency, 845.0 max latency.
2018-11-27 03:29:13, 396893 records sent, 79378.6 records/sec (38.76 MB/sec), 801.3 ms avg latency, 854.0 max latency.
2018-11-27 03:29:18, 386291 records sent, 77258.2 records/sec (37.72 MB/sec), 821.7 ms avg latency, 853.0 max latency.
2018-11-27 03:29:23, 387500 records sent, 77500.0 records/sec (37.84 MB/sec), 819.9 ms avg latency, 852.0 max latency.
2018-11-27 03:29:28, 385733 records sent, 77146.6 records/sec (37.67 MB/sec), 824.4 ms avg latency, 857.0 max latency.
2018-11-27 03:29:33, 380556 records sent, 76111.2 records/sec (37.16 MB/sec), 832.9 ms avg latency, 859.0 max latency.
2018-11-27 03:29:38, 384648 records sent, 76929.6 records/sec (37.56 MB/sec), 824.9 ms avg latency, 844.0 max latency.
2018-11-27 03:29:43, 390786 records sent, 78157.2 records/sec (38.16 MB/sec), 812.8 ms avg latency, 842.0 max latency.
2018-11-27 03:29:46, 17578125 records sent, 77169.470468 records/sec (37.68 MB/sec), 818.26 ms avg latency, 1790.00 ms max latency, 822 ms 50th, 854 ms 95th, 909 ms 99th, 1729 ms 99.9th.